# Creating a dataframe using Excel files

Letâ€™s see how to read excel files to Pandas dataframe objects using Pandas.

Code #1 : Read an excel file using read_excel() method of pandas.

In [1]:
# import pandas lib as pd 
import pandas as pd

In [2]:
# read by default 1st sheet of an excel file 
dataframe1 = pd.read_excel('Sample.xlsx')

In [3]:
dataframe1

   Unnamed: 0    Name  Age  Stream  Percentage
0           0   Ankit    21    ETC          67
1           1   Rahul    21    CSE          76
2           2  Anurag    22   MECH          69
3           3  Anjali    20     IT          73
4           4   Pooja    19  CIVIL          79

In [4]:
print(dataframe1)

   Unnamed: 0    Name  Age  Stream  Percentage
0           0   Ankit    21    ETC          67
1           1   Rahul    21    CSE          76
2           2  Anurag    22   MECH          69
3           3  Anjali    20     IT          73
4           4   Pooja    19  CIVIL          79

Code #2 : Reading Specific Sheets using 'sheet_name' of read_excel() method.

In [5]:
# read 2nd sheet of an excel file 
dataframe2 = pd.read_excel('Sample.xlsx', sheet_name = 1)

In [6]:
dataframe2

   Unnamed: 0    Name  Age  Stream  Percentage
0           0   Sonal    21    ETC          67
1           1  Aniket    21     EE          76
2           2  Anurag    22   MECH          69
3           3  Anjali    20     IT          73
4           4   Priya    19  CIVIL          79

Code #3 : Reading Specific Columns using 'usecols' parameter of read_excel() method.

In [7]:
require_cols = [0,1,3] 
  
# only read specific columns from an excel file 
required_df = pd.read_excel('Sample.xlsx', usecols = require_cols)

In [8]:
required_df

   Unnamed: 0    Name Stream
0           0   Ankit    ETC
1           1   Rahul    CSE
2           2  Anurag   MECH
3           3  Anjali     IT
4           4   Pooja  CIVIL

Code #4 : Handling missing data using 'na_values' parameter of the read_excel() method.

In [9]:
# Handling missing values of 3rd sheet of an excel file. 
dataframe = pd.read_excel('Sample.xlsx', na_values = "Missing", 
                                                    sheet_name = 2)

In [10]:
dataframe

   Unnamed: 0    Name Age  Stream  Percentage
0           0   Sonal   21    ETC          67
1           1  Aniket   21     EE          76
2           2  Anurag  Nan   MECH          69
3           3  Anjali  Nan     IT          73
4           4   Priya   19  CIVIL          79

Code #5 : Skip starting rows when Reading an Excel File using 'skiprows' parameter of read_excel() method.

In [11]:
# read 2nd sheet of an excel file after 
# skipping starting two rows  
L=[0,2,3]
df = pd.read_excel('Sample.xlsx', sheet_name = 1, skiprows = L)

In [12]:
df

   0   Sonal  21    ETC  67
0  3  Anjali  20     IT  73
1  4   Priya  19  CIVIL  79

Code #6 : Set the header to any row and start reading from that row, using 'header' parameter of the read_excel() method.

In [13]:
# setting the 3rd row as header. 
df1 = pd.read_excel('Sample.xlsx', sheet_name = 1, header = 2)

In [14]:
df1

   1  Aniket  21     EE  76
0  2  Anurag  22   MECH  69
1  3  Anjali  20     IT  73
2  4   Priya  19  CIVIL  79

Code #7 : Reading Multiple Excel Sheets using 'sheet_name' parameter of the read_excel()method.

In [20]:
# read both 1st and 2nd sheet. 
df2 = pd.read_excel('Sample.xlsx', na_values = "Mssing", 
                                        sheet_name =[0, 1])

In [21]:
df2

{0:    Unnamed: 0    Name  Age  Stream  Percentage
 0           0   Ankit    21    ETC          67
 1           1   Rahul    21    CSE          76
 2           2  Anurag    22   MECH          69
 3           3  Anjali    20     IT          73
 4           4   Pooja    19  CIVIL          79,
 1:    Unnamed: 0    Name  Age  Stream  Percentage
 0           0   Sonal    21    ETC          67
 1           1  Aniket    21     EE          76
 2           2  Anurag    22   MECH          69
 3           3  Anjali    20     IT          73
 4           4   Priya    19  CIVIL          79}

Code #8 : Reading all Sheets of the excel file together using 'sheet_name' parameter of the read_excel() method.

In [22]:
# read all sheets together. 
all_sheets_df = pd.read_excel('Sample.xlsx', na_values = "Missing", 
                                                     sheet_name = None)

In [23]:
all_sheets_df

{'Sheet1':    Unnamed: 0    Name  Age  Stream  Percentage
 0           0   Ankit    21    ETC          67
 1           1   Rahul    21    CSE          76
 2           2  Anurag    22   MECH          69
 3           3  Anjali    20     IT          73
 4           4   Pooja    19  CIVIL          79,
 'Sheet2':    Unnamed: 0    Name  Age  Stream  Percentage
 0           0   Sonal    21    ETC          67
 1           1  Aniket    21     EE          76
 2           2  Anurag    22   MECH          69
 3           3  Anjali    20     IT          73
 4           4   Priya    19  CIVIL          79,
 'Sheet3':    Unnamed: 0    Name Age  Stream  Percentage
 0           0   Sonal   21    ETC          67
 1           1  Aniket   21     EE          76
 2           2  Anurag  Nan   MECH          69
 3           3  Anjali  Nan     IT          73
 4           4   Priya   19  CIVIL          79}